[
  {
    "value": "  Online? Okay I go go Okay  WAIT I NEED TO PLAY SHAMAn ur finished for shure just end turn 15 more SHAMAN CARDS UGH 3 more ty ", 
    "key": [
      "Foris Kuang", 
      "2017-10-13 17:16:00"
    ]
  }, 
  {
    "value": ":( But I want lich jaina I have 3 price as well Quest mage go Lich Jaina Iis fun Yup should do Not sure if thalnos is necessary I mean I'm doing got and u in and glimmer Ah true... I need kazakus as well and shadow visions sigh Oh ", 
    "key": [
      "Foris Kuang", 
      "2017-10-01 17:16:00"
    ]
  }, 
  {
    "value": "tyyy ? The code has been claimed!! RIp lmao claimed as in already npnp yeagh i need to do that oh right why do you have these 1 emote rest 40 dust mkk ", 
    "key": [
      "Foris Kuang", 
      "2017-10-02 17:16:00"
    ]
  }, 
  {
    "value": "Forgot they close at 6 today. I didn't get to go to Costco in time... Sigh. Rip. Didn't see this in time. Just left, sorry Messenger stopped working for some reasob. Is anyone going to be home in 30 min? If so, help unloading some stuff would be great. Also, looks like seahawks are sucking :P 3 coins, silence, mind blast, velen and mirage caller. I played a game today wgere I got extra coins from burgly bully and did a 74 damage OTK or something. Be there in 10. Sorry this is an exciting moment? Huh? No more excitement :P And will be there in a moment :P Okay, scored :P Help plz. ", 
    "key": [
      "Andrew Li", 
      "2017-10-07 17:16:00"
    ]
  }, 
  {
    "value": "How are you at parsing machine learning notation? Actually, I'll just come home now. Will you be up in 20 min? I'm more or less aware that the question it's asking is not hard, but I can't tell what the question is... Sob. Because I cannot understand my comp bio homework's notation, and I've been trying for hours now... and would appreciate it if you could save me :P See you in 20. Okay. ", 
    "key": [
      "Andrew Li", 
      "2017-10-15 17:16:00"
    ]
  }, 
  {
    "value": "Rip Stab me Oh my so descriptive aiyou Spicy when did you wanna go to dubhacks NOOO or can you register us do we all need to be there to register No Too much effort I don't wanna go now Is there foid Have laptop now Updating Ubuntu subsystem I know I'm coming soon Dick Yeah Had Eddie read me Yeah I know But I'm actually updating and setting up Dev env Dick 龟兔赛跑 我们要走了  No I'm not 我们到了 ", 
    "key": [
      "Foris Kuang", 
      "2017-10-20 17:16:00"
    ]
  }, 
  {
    "value": "down ", 
    "key": [
      "Foris Kuang", 
      "2017-10-18 17:16:00"
    ]
  }, 
  {
    "value": "free pack pls Also can you win a game really quick    ", 
    "key": [
      "Foris Kuang", 
      "2017-10-17 17:16:00"
    ]
  }, 
  {
    "value": "Haha Oh I was grabbing laundry Heh And free laundry Yes! Cause they haven't replaced the coin catcher Yeah Cause people didn't know about it haha Eddie and I made 8 dollar profit last night So you put coins in and take them out haha I'll show u tonight or have Eddie show u I had some coins in reserve Oooh okee where do i choose for pack challenge a friend Are you not in class atm ", 
    "key": [
      "Foris Kuang", 
      "2017-10-04 17:16:00"
    ]
  }, 
  {
    "value": "Sure. We also get warlock skin for showing up, 50 dollars first place, 20 second, 10 third. There is a HS tournament at MS Store in UVill on 27th, Friday, and it's a different format (deckhelper \"draft\"). Want to go? Also, will send link for registration later I'll do it later, then. Downloading patch. https://www.facebook.com/events/1514943061875808/ ", 
    "key": [
      "Andrew Li", 
      "2017-10-17 17:16:00"
    ]
  }, 
  {
    "value": "When do you get home tonight? :P Do you want to practice your drunk Halo skillz again? ☺ Get embarrassed? ☺ Let me know when you are back, I guess :P ", 
    "key": [
      "Andrew Li", 
      "2017-10-06 17:16:00"
    ]
  }, 
  {
    "value": "but not sure if snapchat is still open for pinterest the grad intern one alley the description of what youll do seeems right up yoru ally apply and see what happens Those are not requirements is what i was told but i think its jsut to get familiar with the product its pretty aiyou i created one as well yup  ", 
    "key": [
      "Foris Kuang", 
      "2017-10-14 17:16:00"
    ]
  }, 
  {
    "value": "Okay O Can I finish your pack of nori? The box of bits on the refrigerator is missing 4, right? It fell off the refrigerator and I think I found all of them, but can't be certain. ¯\\_(ツ)_/¯ Oh. Hmmm... Eddie said it was missing some to start. ", 
    "key": [
      "Andrew Li", 
      "2017-10-05 17:16:00"
    ]
  }, 
  {
    "value": "Which role should I apply for for Pinterest and Snapchat? The one in SF? New grad? Rip. :P I don't think I fit many of the \"What we're looking for\" points for this: https://careers.pinterest.com/careers/details/pinterest-labs-research-intern_san-francisco_837032 Okay, fine :P Rip, I have to have a pinterest url to apply? :P Excellent :P So, what, your pinterest URL has nothing on it? :P Oh well :P Rip rip rip. You got 3 packs, I got 2. ", 
    "key": [
      "Andrew Li", 
      "2017-10-14 17:16:00"
    ]
  }, 
  {
    "value": "Or know anyone who does? I don't suppose you know any OpenGL, do you? Also, to be fair, so did I :P Phillip Wang? Sigh. Picked Pavel for choose your champion again :P I'm ready to go one-pack :P ", 
    "key": [
      "Andrew Li", 
      "2017-10-03 17:16:00"
    ]
  }, 
  {
    "value": "https://srw.seattletimes.com/restaurants/sushi-kappo-tamura/ Looks p. good. ", 
    "key": [
      "Andrew Li", 
      "2017-10-18 17:16:00"
    ]
  }, 
  {
    "value": "Yeah Parent think pink one was thrown away or Michael took it. By the way: https://www.youtube.com/watch?v=I_lKF-4JZgA 3prince is disappointing :P But can hardly complain since it was free. Just got a double legendary pack with frost lich jaina and 3-prince. seems bad. *mqge Why would you play a 9 drop in quest mag? Also, probably going to stop opening frozen throne packs to save up for next expansion Yeah, that's true. So, strongly considering crafting Anduin + Thalnos + Dragonfire + Glimmerroot package. dropping 4000 dust, tho :P Thalnos is really good with spirit lash I think glimmerroot is less crucial than thalnos. Almost done with the homework that got handed out I'm so bored in grad algos. 1 problem left... ", 
    "key": [
      "Andrew Li", 
      "2017-10-01 17:16:00"
    ]
  }, 
  {
    "value": "Not sure and sure Okee ", 
    "key": [
      "Foris Kuang", 
      "2017-10-06 17:16:00"
    ]
  }, 
  {
    "value": "I'm omw to practice Oh sorry what's up Rip ", 
    "key": [
      "Foris Kuang", 
      "2017-10-16 17:16:00"
    ]
  }, 
  {
    "value": "I lost value... Noooo. Yeah.. ", 
    "key": [
      "Andrew Li", 
      "2017-10-19 17:16:00"
    ]
  }, 
  {
    "value": "This is hard to listen to. Wow. I understand why your favorite person ever makes you not want to go to the labs at all. Headphones on! Something something \"Facebook gives you so much free stuff\" something something \"Facebook seems less reputable than Microsoft\" something something \"Working on social media is ehhh\" something something. Me first. Please :P Good descriptions are the spice of life :P Preferably starting from the part of my brain that understood any of that, then moving on to the ears and so on. Will probably go back to labs to grade after registering. For registration I'm at the HUB right now I mean, we need to register and everything,right? Are you not going to be here until past 5? Whatm I think you register individually Your choice then, man. :P Suck it up? Uhhh... Okay... I mean... Okay. So, I don't see what choice you really have, man. Although you can't really not register... Not yet. :P 缩头乌龟 Okay. Nice :P you learned another wonderful chinese phrase :P Did he tell you what it meant? :P :P Did you understand? :P I don't see what choice you have :P I mean, you said \"Too much effort\" before :P Okay :P See, regardless of if you keep your head in your shell right now, you're going to have to leave at some point :P Silly 乌龟  快走了呀、乌龟先生。 不走这么赛的过兔子? Are you there? Okay. Uhhh... Hurry up. Or rather, far wall from where you walk in. Got 4 seats. Back wall ", 
    "key": [
      "Andrew Li", 
      "2017-10-20 17:16:00"
    ]
  }, 
  {
    "value": "Yeah ill be up for a while but send it over and ill take a look Can't guarantee anything doing hw ", 
    "key": [
      "Foris Kuang", 
      "2017-10-15 17:16:00"
    ]
  }, 
  {
    "value": "What did you have this morning you had to leave so early for? Dryer fixed? :P :O Do I need to do my laundry today to get value :P Why free? :P Wooooow :P Oh, where did you get your coins? *does change? There's a machine that changes? As far as I can tell. The espresso is pretty good. Check hearthpwn Okay. Nope Maybe do an extra internship next fall. I think I'm def. going to do 4 quarters for 5th year. ", 
    "key": [
      "Andrew Li", 
      "2017-10-04 17:16:00"
    ]
  }, 
  {
    "value": "why u not home\\ no mp Alphabetical CaoKuangLi and wifi material is on urs i just moved boris over to our side  U up? amoutn and have quicker access to food that encourages the eating I think it has to do with the fact that we are simply at home more often ", 
    "key": [
      "Foris Kuang", 
      "2017-10-09 17:16:00"
    ]
  }, 
  {
    "value": "Free now? Too late now. Was going to ask you to meet me at Safeway. I have a challenge quest Quick quick I need to not lose value. I had a friend help me :P ", 
    "key": [
      "Andrew Li", 
      "2017-10-16 17:16:00"
    ]
  }, 
  {
    "value": "At least Pavel won his first match :P Who did you pick, again? So, both of us need 1 more win to get 1 extra pack, then each win after that is an extra pack up until 4, I think. He won two. Although I think Pavel and Purple will meet fairly early in the main draw. Purple has to reverse sweep to go through his group 2-0 Purple just won off the sickest Evolve I've seen Waow... Are you following this game right now? turn 7 doppel double evolves into swamp king dred + 4/8 windfury + stormwind champ with bloodlust in hand to win the game the next turn. 4/8 windfury pushes so much extra damage with bloodlust. Absolutely ridiculous. Swamp king dred blocked the lyra, thalnos for spell damage, and priest of the feast to heal. Rip, purple lost. Has to play a decider to move on later. But as long as he wins the next match, you still get +1 pack Uhhhh, maybe? Does it try to do pointer arithmetic? Nah, it should interpret pointer as a pointer and subtract them and return an int. I think. No, I was thinking pointer arithmetic in the sense that it treats the second one as an int, and moves that far away. :P I suck at systems. Why are you asking me and not Google? : I think so. ", 
    "key": [
      "Andrew Li", 
      "2017-10-12 17:16:00"
    ]
  }, 
  {
    "value": "tyty If you do end up going to costco can you also get more bagels! ?  Feels bad played Priest mirror. And raza and anduin bottom 2 It's triggering Yeah we watching atm It's now  Graham Yayayy  ", 
    "key": [
      "Foris Kuang", 
      "2017-10-07 17:16:00"
    ]
  }, 
  {
    "value": " i chose at random did he lose purple RANDOM SELECTION IS BETTER WOOOo :( question mk i have two pointers and i subtract them from each other does that give me the difference in the addresses they are referencing? it should right so subtracting two pointers should give me the difference in addresss... oh nonon Finished it. Returned the difference as an int which needed to be multiplied by 4 ", 
    "key": [
      "Foris Kuang", 
      "2017-10-12 17:16:00"
    ]
  }, 
  {
    "value": "This though: https://www.polygon.com/2017/10/9/16447460/rick-and-morty-szechuan-sauce-mcdonalds-fans-anger Graphics sucks. comibg now Sorry Did you change WiFi passes? Oh, rip KuangCaoLi? thanks just woke up, yeah I was just talking to Eddie about this yesterday, but we sure are a family of bingers :P Or maybe I'm just not used to living with other people who eat a lot regularly? But other than with the OJ, it surprises me every time to see \"Wait, we ate that much of that already?\" : Oh, by the way, the Pub Mix is in my room because I've been eating some late at night in my room to not disturb Eddie. Grab it if you want. Mmmm, I guess that's possible too :P ", 
    "key": [
      "Andrew Li", 
      "2017-10-09 17:16:00"
    ]
  }, 
  {
    "value": "I need to play 50 priest cards.  Will you be free later? Also, how do I apply for Pinterest and Snapchat? :P I'm going to make it look impressionist, I guess. Also, favorite piece of non-impressionist art? Okay sure. It can totally be a photo as well Or try to. Quest? Will not take long. rude :P please no kill radiant rip turn :P  Wow, rude af. gogo Sorry :P ", 
    "key": [
      "Andrew Li", 
      "2017-10-13 17:16:00"
    ]
  }, 
  {
    "value": "busy day? ", 
    "key": [
      "Foris Kuang", 
      "2017-10-19 17:16:00"
    ]
  }, 
  {
    "value": "No... Phillip may no as he did visión for his internship Yeah ", 
    "key": [
      "Foris Kuang", 
      "2017-10-03 17:16:00"
    ]
  }, 
  {
    "value": "Overwatch 5x lootbox code XPR6-NN94-XXN9W-HCTG-8H5N Oh what? Good job. This is for 5 loot boxxes. I copied the legendary loot box one to another friend over the summer CCBB-LCL3-HKWDG-CG4S-XRD9 Ah, I'msorry and I have amazon prime. Which is linked to amazon prime Twitch prime. Get anything interesting? Oh well :P At least it advanced the pity timer, right? :P Anyways, if you remember to remind me, I think there are also some you can get in October. If you had your desktop a couple months ago, you could have taken the guaranteed legendary box too. ", 
    "key": [
      "Andrew Li", 
      "2017-10-02 17:16:00"
    ]
  }, 
  {
    "value": "okay! I don't think that's mine .. Oh wth. I don't remember OK... ", 
    "key": [
      "Foris Kuang", 
      "2017-10-05 17:16:00"
    ]
  }
]